learning-spring-ws-server/secured.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:test="http://greglturnquist.com/test">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1">
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  
                wsu:Id="XWSSGID-14072105829651149256297">
                    <wsse:Username>user</wsse:Username>
                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
		<test:sendNetworkEventRequest>
			<test:hostname>router101</test:hostname>
			<test:severity>5</test:severity>
			<test:description>Ping failure</test:description>
		</test:sendNetworkEventRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
